results/spring-quarkus-perf-comparison/2026-02-05_12-30-36/wrk-warmup-quarkus3-native-1.log
Running 2m test @ http://localhost:8080/fruits
  2 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     9.74ms    9.35ms 145.75ms   86.27%
    Req/Sec   10176.88    948.18  10779.00     99.17
  1231403 requests in 120.011s, 946.52MB read
Requests/sec: 10260.75
Transfer/sec:   7.89MB